node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5175887
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\212\327\014\276\216\000/=g6g<\365\256{>\264F\031\275\307E$\276du\240<\013\035I=\025\235\255;\205\203\305<\235\234\017>\214\250\031\2764{\252\276\215\023.>\273\214?\275\200\304\016\276a\237\274\275^\224\305\275\270\370%=\332Ic\275\010\230\244=\017Jv;\310\351\032=\002%\254\275R\342\241=X\254\000\276\023*k\275\035M:\275\377\231 \275\270x\224>\273PI\276\311\037\010>\016\\6\276\037\376\345\274L:b\276\201\006\360\274q\355\240=\244\234\017=\325\355\202>3\261j\275x$\032>\\\322\025>\273\346\003>vb\003\276f\014\250<\355a\033=I\370\222\276\350<\010>HD\322\275V\324S=X\005\350=\024[\203>\235#\303\275rF\341<`\335\274\275\003\031\242=\203\376o\275\350b\270\275{\035\236\275\027\303\243=\005AF>\250P\347=\271.h=\325\234\223\275\034\302\227\276X`\336\275\211\333T\276D{j=\032$\242<+\240\027\276MUZ=NZ\216\275N)H<DrU\275\223\023\177\2757\007\352\2759i\241=\332\215>>\362\351\216=\365\250\241<\177\345\362=\025k\332=Z\262\220\275\nv\263\276\021\370\247<,\r,>\217\355;\276\220Zk>\306 \215\275{F]<\352\336U\275Z\214D\275\014\306\033>\242\025<\2749\365\241\275{\017\265\275\265\367+\275\276\317^\275\340\031O\276\227\373\206\275\177\253\205=}bM>g\374\271\274o@\220<l\342\336=Z@\212=\237p\003\275\247\337\200\275\263v\252\275\246\0017\275\265\370\375=\226\305X=?\r)=9Lq>_\263\343=\242\322Z\276/\337\360\275\342\026\236=*\352{>\325\\W>\363Hn\276kqy>8\341e\275\363\375\205=\217\251\366\274\335\324G\276%+v\275PrD=,V\244>\274\243\030>\263M\025\275\025\032\313\275H\245\260=\2242P\275\343OO=\263\336\227=\351\361\377=p\257`=\224\003\306\275\274Wf\2769lo=R( =\343\371\340\275\304\260\373=\267\357\311\272\177\211\276<\341\352\365=\210t=\276`\237(>\276\310)\276T\2057\276\205\320m\275\031#z\274\004\n\271\275g\335\027>\";U\275\035s(\275hu\212=\357v;>\223_\307\275,\026\243\275\236\211\253=\3311Z=\322\027k\273\006\323\335\275)^B>\204o]\274/MA=\337\224\336\275\235\313\355\272\223~_\276\303w\200=9~\257>\377+x\275\355f#>\231\343\004\276[\300\223\274 \255\206=V6\013>\321I4>P\270e\276\374\261\336;h\2139\274\024\024\326\275\352\215\263=\227\214\023\275\221\363\017=@\353\301\274\306M=\275\013\205.\276\222\361\360\275\021\273d<\357.\252=\016\210\263=\232\264\305=\315<R\276\347\373d>n\'\362=\340\3153>\272\020*\275\005n\033\276:\273\013\276\'\330H<\016\373\017=\036h\367<\265\360\267\274pi\270=\214\020\205=\245\3210\2765\026\005<\241X\014\275\277\252\024>\035\037r=\262\260^>\tk\030>\315\301\232=,\241;\276\335H\347=\251\026\222<\316\227;\276qc\256\274\212\250r>*5\244=Y\230\277=\351\021\023<\267\266\016>\370Wk>B\376\201\275\360\275\252\275\326\276\342=\000\251\231>\240}\307=U\273\310<\235\302%=\304\263^=t1\035>l\326\236>\333(\025\276&S\013\276]\306\022>1\372\324=<P\002\274\211\323\253\275\3128h>Y\006\300=\2579\004=\357\326<>\2469\002\2763,\207>\301\310\273\275\021t\333\275Hmh>]U\026>\237\330.>\256\317\306<Q(\340\275CZ\301=\200;\'\274\243\347G\276\036\222\243=\355\242\\>\203\022\342<\273Y\320:FN\336=v\227V=\210Yq<\206\203L>_E\364=2e\223=\004l^>\242\001R\275Q88=\374K\207=3XD\275\023\220\n\276\325*\213\275a\226\327\274-\363\241>\355\'m\276\347\244c\275|\'u\276\007\2570<\205\337\017>\3112\265=\270\217\005>v\326\005\276\301\363\375<\r\321&=\361\217\221\275\033\261\372\275\001b\360\275\037X\225=\016i9\276R1\215=\225\333\322\2752\334\312\275P\277-\274LN\243=&\332\007\275\020\361%>^\025\277:X\212\365\275T\230\030>f>\207\276\203B\200;\302\n\037>D\215b>X\255J\276U\344\355=\350Wc=jj\t\274<3K\276B\004V>|\004\264\275\352\252\214\275\022[#\276\234\034\032>5\3634\275\033\036J>\370H\224\276\014\360|=1\237\204=\177\2522=\345\216\351=Ms\377=\335\003O\275o\226\335=\222\201T\275]\250R<\t0\220=\263\365\375=l\326\372\274,\231\337=\313bQ\276Pz\177\276\002B\226\275\306\347$=9J >\003\th=v\212\275<\245\240\205=z\306\"\275\006.\010=\2041\271\275\267\363\004\276\257$\200>\320O\003\276\200V\240\275C\031j>@)<\275\023P9>T\246\032\275o\376S\275\021\215\357=p\004W<a\255!=x\211!\276\261\207\004\275\262\032\374=\205\311l\275\235\331\002>\n$\022\276\321\032\320\275\220\026\364\274\366\375@\275x\246g>0x\027=I2\t>\007I\253\275z\347\274\275]\007\354\275\346\305\300\275\203\025M\276n5\352=>\221\r>\215\037\363\275\373Z8>\232\235|>\3556\"\275@\266\326\275\211\325\000\276\235\312\232>\214\377T\273Dq\333\275\272\220)\276;\014\'\275\346\326\232>\341s\207\275B2\335=\3001\332<O\365\223\276]\212;\276\302\236\213\274\373\3301=\316\0175\276\274C,\275\204k\375<m\215s\275\3041\250=\252\025\340=\310\323?\275H\244\327<\231\237\315\275U\340\376\275\013\350\254=\020:C=\3719\177>e\220\231<X\214\353\275\367\312l=H\t\307\273\241\235\307\275*\212k\275 \261r\276\275\300\'=\351\205\033=\265\237,\276\202\217\002\274\n!\265\274\346+\213\273\344*\332\275\344B\036>A\341Z<\364W+>\307\250\2649\305\372X>\005u\221>V\\\360==\340\352=\273H\237\275L\323\250=g\227\270\276\361\266\352\275M|,\276\371k\231\274\307\010\016=vi@=\276\2039=Un#=\342\307>>E\024\226=\347\240\013\276~\250\330=A\354\"\276\206\363\322=\314\036\205\275\267\236-\276\017Y5\276\232%\312=\351v\273\274\374\306|=<-\027\276\240p\371<\276\334\004>\024\022\272\274[\251\354=\216\273\'>\356\325\363=\257i7=\357\232\025=\226\225\032=\237~\254\275\307w\224\275\'\374\207>,~\'=\036\242\245=F\216v>_\336\200\2769\327G<\337\246Z\275\252v\325\275\202S0=\005\013\360\275\016G\266<u\274\334\275I\004\034\276\271\3118=\230\340\373\275\332\217%;\354\371\366=\315\241\374<\2568\021\276[\002\277\273\2124\376<\013|q>\323\267F>\327\246\033\275\3562\314=^\005\r\275\013\361L\276\273B\257>6\177\210\275s\305\335=\204$\024=\250\023r\275\031W\000>\037-\007\276K?\277\275\202\255\236<\002\006\366=\024\266\367\274>f\274\275T\367N<SL\010>\343Z\234\275\245\257:\276\221\242\031>S\345\372\275\346Rg\273\250\t\322\275\n\320t\275\273\303|\274Bm\020=7L\362= \266\371\273n@\332=\220f\263\275\007\377\317=%b\344\275\232P/\276\014\003\200>0^\215>\307\237j>\024\216a\275\031w\235=T\2620;\213):\275A\307\225=T\270)\276!ZM\276\016\260t=(\2759\276R\336\304=c\270\375\274\023\270\300=^\244\360\275=\2045\2760o\000\274Kio>\355I2\275\240\212\222\275_f;=\205Z[\274Q\357\365=\366\324k\275\017\035\312=j\211Q\276\302\221\310\274:\312\277\275\213\205\200>\214\375!\276\243\036\232=pD$\276f\312\004\275\260\003g>\006\275\\\273L\364[<\361\322\211=P\320O=aC\004\276f n=T\342\362\275$\020\302\275_\004\235\273>\'\277=\264?\330\2750eH\276\205\023\031\276\366\034\017>\202go\276\225\3728\274\262\333\216\275\230\360\016>\023YZ\275\2726\301=\273\366\032\276\007\205i>\354\216)>y\273x\276\'\007\201\276\300\337\354\273\014T%\273\020\232 >/\2343\276\325d\024\275\276\n\317\275R\320\213<s\256\370<&\266*<\210\275\362\275\001\313J>\354\250&\276)\010|\276m\026\014\275\350b2=|\325\243=\252\300\371\275\017n\036\276\356\215\310\275k^\313=\230f><_\032\336\275D\350i\275\267:\316<)\345\321=\227%\023\275T3_\276\031f\364\275\206\366\036>\256\317\245;\362\231\260=\203\005\266=6\025\333\275%+\032>3\206\252\274\360rC>\320\302T>\353X\017\276\016 \"=\'F\250=\034\354\033=N1T\274A@\024=c\361.\2752c\306=\213\250\014=\266\007\177\275E\203<>l|\257=\215\234r\275\2260\367\275xL\364\275\327p[>-\364\201\274\305\251\326\275\363\213\341\274$\326\206\275\220\007x\276\026>\276=h\3331=\245\354\255<\352\262\030>\343\027\253=\224\357m=\302\345\366\275}\352\255>r\r_\275\311\341R\276_g\267=\247k\232\276-#\277\275\"6\327;E\315\201\276g\254o\276\307\320N=\216\243\320\273K7N>&\010\301<\211H\007\276\335\004\277\275\237\201^>vtw>\016\225\345\274\227j+>\347\331\177<vI\265=\336\303\316=\351;\005=\367\241\t=^\227;=JMX=\330\324Y=~H\177\274\222\312)\275\017\360e\276\233\333+>\245\332A>\214t\210>{\325\210= \213\365\274`\224\013<\265\224<\275\216\276\255<\213\360\244=#\324\366=\313g\013>\305N\002=N&J\275W\327\342\275\310\341N>\305\217{<v0\033\275\205\203f\272\334\342\377=\352\361\354=Ej\342<\014\356\371=T\201\021\276W\003\206\274\205{s\275N\027\356\275\277\233\205=Z#\253=\336\0010\275\254\240\341\275\275\276C\275:;\236<aN\242>O\345\222>\261\032u\275\333\206\231>\271\352\262=\235\005\277=1E\220\276\250\021\206\275Ks%\276\263<\311<\307!\\\275.\204\263=B\362\022\276\312\357f>\0041x>\032\300\244;\016\314\027\276O5Z>\324\301@\276\262\251>\275\346\243A\276p\303\030\275\265\2355\276\300\250%>5q\256\275\230\224\204\275M\214\277\275\013j\000>\315Z\255=\033\254O=+\252&;\261\325\243\275U\354\204<\330\262\250<\377/\265\275\262\3637=\201\003\275=\215\003\211\276\354\261\347<\346\tM\276\010-\035>`\031\271\275O\225u\275\0013\344=}\365\010\276\245Xk<\323i\223<\316\217\306\275f\303\020\276\211o\206\275\3168\260>\2127\255=|A\253\275JD\206\275\316\037\375\275\2530A\275\020\242\220\275&\340\220=\257 \304=N\330\332;&\262\035\275\275\264\262\275M\305\325=(\352\'=\364\3177>W\'\"=v_\234\276\004\267\240<\201\2458=!\237n\276\250\325\260\2759\001\020\276<\024\354\274\322&|=\361\222.\276\\\314*\276\020Do\272\373\231\007\276\321\361\365\274\340\230\254=C\010v\276\345#\223<b\275l\276@\366\005\274\331k\200\2756\004\372=\t.\006>\2277\260=B\r;\276*\251\305<4\256G> \216\347\275\3162K=\3649a>\351,\215\275U6\311\276hy,\275\022qU\275\357\031]<h\2521\276\223\351o\275\302\301\347\271C\376\230\274\"\223\201=)\247\244\273\250\310\221\276n\"\013>\227\246\350=\215\342\304=>\262\245=\003\rD\275\376\0336>\022\230\013\274\032|\\=>L;\275\242x\310:a\037\366=M\322/\276\002\355k=\300N\t\275\245\360%>\205I\377<\223.\206\276D6x\275K\r\247\275xo\352\274T s=\314\241T>V\213\216=\252\350\324\275\036\353\366\275\026\301\277\2750]\353\275\327qz=\035\347\222<\371\355\014>\261=\322=X2k\275\017<\232\276%\363\225\275\235\224%>=\274\232=C\312t\275\005\037d=4[|\276\201\006\225>%\271\200=\235\3321\275B\002\310\274\222^\241\275\016\016\024\276\346\273:=\260\203\325\275\225V\211> ~\022>0p\n>\275\334\333\273\306\243$>\002+Q\275\324\217\312=:\0238=R;\275<\321q\312\275Q\306\303\275\302W\276\275\307ff\275\232c\003>\236s\034\275\317\310\002\276\226\274k=\360r\200\275\322U\205\275P2u\276\323Ev=I\2263\276\334\033\343\275\300\262\253=Z*6>I\275\273\275\022:W>\270\205\344=\357(\024=\253\373\226\274G\374f=\373\0068\275DX\361\275~\307\017\276\361g\261=24\233>\376\224\020>*\314\251;\236\022|=\013\316E\276J\022\300\275\022\342\240\275\271\227\035\276\332\002\214\275O\005\307\276\307\257\343<s-\">2\311Q=G\'\001>\245J0\275\n\345T\273L2\027=6\"\320\273\267\253\277=\314\340\002\275[\256\021<\362\274n>\36501\275\254\213\274<\314*\006<\255\326U\275\025HA\276\300\t\364=QP\006>\306Z\202\276,l\252<\261\343><Q\340>\275\331\005\370\275\020\254\373<\246\333\031;g\314N\275\321w\306=U\375P\275\017`M>\0025]\27545\216=\314\257\233\275\"\323\030\276\205>n\276\371\236->\315\201\006;#-k\276\002\033S\276\373\304!>\256\362\314;Q)\340\275\003\314\200\275\303_\206\275\'X6\276P\3244\276\314\nZ>i\325]<T\226)\274\337e\200\276j\360\357=\332\256V\275\323\216\257\275\366\306\177=\354\267\"\2764\365\013>j\316\202>\'\221?>\253\213\335\275\332X\337\275\261\300\367\274+\252J>;\371s\275\222\312b>\253T&\275\301\301\201=n<;>\2254\r\276\340\230\210>)\r\205\275\241_\324\275M\216\220=\354\220\211\275J}\251=\272\227\237\275p\255\255\275N>@\275<\247\235=*\014\233\276w1\314=\365\233+\276\373G\004>\276~\261=\356\231R\275\300\244e\276\2137R>\025\240\205\275/`A\276DQ\306\275\326\336=>\306\332\355=\202\364\322=9\247\244= \005A=\267\320\t\274h^\340=\214\273\227=\237W\327=\035\234e\275\003h\315=2R\231<9\230/\275\323\263?=52]\275\016\272\374=\344\024\253\275J0\227\276K\231H\275\316L\330\275\033ln<(\225\260\275\233\327\352<o\332\004>v\222\003\276$\236o\275\212%\335:\301\230\243\275\014\000\215\274\326kH\276o:u\275\335F\034=\256\034\264\275e\030=>f\261\203\274\262\273\262=\222\263\200>\234\3679\276q\353\374\274\343q(>\352\255\017\275\"38\276\277i6=O\017b\274\033\223\002\275D?f\275\261\016\202\275\362\256}=Gf\037=\221\330\307=\355l\314;*\'\341=]\354/<l\307\321\275\034\224\213>TQ\306\275X\301->_\353(<>\2205>\3677G>\275\345\214>\226W?\276\335\267\241\275\346\277\332=\266\022\253=\263\301.>\207\200\341\275D\362\227=X\0362\274\005\366p>\303\245\270=\364\310\247\275~?\033\276\277\366J>\234\036\314<\216\322\230\275\367G\324=/5&>\276o\032\276O?!= \356\251\275=\330\227\275\t\262\254\275\340\337}>\304\255c\276\225\365\267\273\314\304\005>\225\035\365\274\232\257\034=\026b\244\275\264\233\356<\323p\035<I\0034>\377\316\263\276\217q,\276\221\034\376:\331\023\365\275O\205\243;f\354\200\276\303\372$\275j\256.\276J\254\023=.i\321=\204R\313\2757\266\254\275%e\270\274L\304\023>\020\272@>\311^/>Z\372\010>\311\005\210=\204>]=\374\023\031\276O\334\353\275*{\254=L\245\234\275~\231\033\276\000\3645\2767O\227=\231\201\232=]\220\207=K\332\335=\311\314A\276\315\024w\273\036\035\322=\001\276R\276\223{\021>\351\210\014\276\337\023\371\275\370\203\317\274oU\211\275K\260n\275\277\321\324\273\267\3264>+v\214\276\377`\241\275\375t\370=\361\017\302\275\257\306\366<\261\273\020>\366u\234\275\240\213\227\275\207!a>\003\006+>\242\371(=\335\207\362=\325\320\361<\305SX\276px&\274\255\177\262=\014i\210\275\260\310\317=\215r\014=\020\372\030>\254H\352<;3-\276\300S\">\024\221{=\205,Z\275jH\217=@\2625\276Q\t\311>#\000\246=\206\ny\27581\030\275\212\244e\276&@a\275\017\014\'>H\0014<=\326-\275\020\257\014>\364\360\344\274o\032P\275\264\016\265\275$\235\257\276n`\034\276\225\317\355\273||\001=]\367\036\276>\2229\276\236\314\255=\264\033&\276\277^+\276N\002%>\200I\245\274\236~<\274B\221\336\275l\360\222;\375\243>\276~\246R=\252\247$\276\177}m\275\035<\223=sL\003=\260\253Q=\251\016[<q9\335\274\n\275\300=\214\376\013\276\232\305\373=\r\273.>\022b\314\273\330\314\200\275G\221$\276\355\207\022\276\306\274B>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
